#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-pzEfJRrYmETJZfQo

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_cloudwatch_event_rule.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_cloudwatch_event_rule.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_instance.bastion_instance: Refreshing state... [id=i-019ffb9c39279483f]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_lambda_function.SyncApplicants: Refreshing state... [id=ien-dev-syncdata]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_lambda_permission.hmbc_to_ien_masters: Refreshing state... [id=AllowExecutionFromCloudWatch_Morning]
aws_cloudwatch_event_target.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants-terraform-20220421203905110400000001]
aws_lambda_permission.hmbc_to_ien_applicants: Refreshing state... [id=AllowExecutionFromCloudWatch_EarlyMorning]
aws_cloudwatch_event_target.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters-terraform-20220421203905121600000002]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.SyncApplicants has changed
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
      ~ last_modified                  = "2022-06-07T13:16:20.000+0000" -> "2022-06-07T13:19:48.000+0000"
      ~ source_code_hash               = "Awiu+MfigKD8GIuYocGSya1NB9584H1lscBhkmd385U=" -> "IP4K0bJ3Gw1NLphoj9SuYQ4CXaX1SONZMDXBzfwP8K4="
      ~ source_code_size               = 49030861 -> 49031071
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.api has changed
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      ~ last_modified                  = "2022-06-07T13:16:20.000+0000" -> "2022-06-07T13:19:41.000+0000"
      ~ source_code_hash               = "Awiu+MfigKD8GIuYocGSya1NB9584H1lscBhkmd385U=" -> "IP4K0bJ3Gw1NLphoj9SuYQ4CXaX1SONZMDXBzfwP8K4="
      ~ source_code_size               = 49030861 -> 49031071
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.event_source_mapping will be created
  + resource "aws_lambda_event_source_mapping" "event_source_mapping" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.SQSLambda will be created
  + resource "aws_lambda_function" "SQSLambda" {
      + arn                            = (known after apply)
      + description                    = "Trigger Lambda when new Message received in SQS"
      + filename                       = "./build/empty_lambda.zip"
      + function_name                  = "ien-dev-notifylambda"
      + handler                        = "api/notifylambda.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::588188670678:role/ien-dev-lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "0XCcYIn0+jTjUwxPorWwPN2f8zZKRGEzZOOQyWVxIQw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0a37263c5e776d030",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.SyncApplicants will be updated in-place
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "cfe8648" -> "c6a8cce"
              ~ "BUILD_INFO"        = "cfe8648, GitHub, IEN-297-Apply-filter-on-recruitment-related-withdrawal-reasons-188, grafted, HEAD, tag: refs/tags/dev" -> "c6a8cce, GitHub, Merge-9de0e3a44cc8e52c5fe3058f60f66dcae486c2f5-into-6e3725263dae9d904676cfb2f52a526cb5949eba, grafted, HEAD, refs/remotes/pull/196/merge"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "cfe8648" -> "c6a8cce"
              ~ "BUILD_INFO"        = "cfe8648, GitHub, IEN-297-Apply-filter-on-recruitment-related-withdrawal-reasons-188, grafted, HEAD, tag: refs/tags/dev" -> "c6a8cce, GitHub, Merge-9de0e3a44cc8e52c5fe3058f60f66dcae486c2f5-into-6e3725263dae9d904676cfb2f52a526cb5949eba, grafted, HEAD, refs/remotes/pull/196/merge"
                # (12 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_sqs_queue.terraform_queue will be created
  + resource "aws_sqs_queue" "terraform_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "slack-notification-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ service_account_iam = jsonencode(
      ~ {
          ~ Statement = [
                # (3 unchanged elements hidden)
                {
                    Action   = [
                        "rds:CreateDBClusterSnapshot",
                        "rds:AddTagsToResource",
                    ]
                    Effect   = "Allow"
                    Resource = "arn:aws:lambda:ca-central-1:588188670678:cluster:ien*"
                    Sid      = "AllowDBClusterSnapshot"
                },
              + {
                  + Action   = [
                      + "SQS:SendMessage",
                      + "SQS:ReceiveMessage",
                      + "SQS:GetQueueAttributes",
                      + "SQS:DeleteMessage",
                    ]
                  + Effect   = "Allow"
                  + Resource = "arn:aws:sqs:ca-central-1:588188670678:*"
                  + Sid      = "AllowSQS"
                },
            ]
            # (1 unchanged element hidden)
        }
    )

------------------------------------------------------------------------

Cost estimation:

Resources: 2 of 9 estimated
           $226.3600000000000008/mo +$0.0

```

</details>